data/google/gke/gpu/16/node-10/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     10630.17
    fsyncs/s:                     13617.00

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               166.10

General statistics:
    total time:                          10.0076s
    total number of events:              242568

Latency (ms):
         min:                                    0.01
         avg:                                    0.04
         max:                                   24.16
         95th percentile:                        0.04
         sum:                                 9954.71

Threads fairness:
    events (avg/stddev):           242568.0000/0.00
    execution time (avg/stddev):   9.9547/0.00